Tarea1/Difusor_piter_v2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	frontAndBack
	{
		type	empty;
	}
	outlet
	{
		type	fixedValue;
		value	uniform 0.0;
	}
	inlet
	{
		type	zeroGradient;
	}
	"(lowerWall|upperWall)"
	{
		type	zeroGradient;
	}
}

// ************************************************************************* //
