Tarea1/Difusor_piter_v2/constant/MRFProperties
FoamFile
{
	class	dictionary;
	format	ascii;
	location	"constant";
	object	MRFProperties;
	version	2.0;
}
